tap "arkweid/lefthook"
tap "aws/tap"
tap "buildpacks/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "johanhaleby/kubetail"
tap "kdash-rs/kdash"
tap "redis-stack/redis-stack"
tap "sanemat/font"
tap "sigstore/tap"
tap "snyk/tap"
tap "universal-ctags/universal-ctags"
tap "vmware-tanzu/carvel"
tap "vmware-tanzu/kpack-cli"
tap "yutomizutani/jc"

cask "alacritty"
cask "brave-browser"
cask "chromium"
cask "confluent-cli"
cask "cyberduck"
cask "dbeaver-community"
cask "devpod"
cask "drawio"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "gyazo"
cask "headlamp"
cask "hex-fiend"
cask "imageoptim"
cask "lulu"
cask "macfuse"
cask "mongodb-compass"
cask "muzzle"
cask "osxfuse"
cask "postman"
cask "rancher"
cask "raycast"
cask "rectangle"
cask "redisinsight"
cask "skitch"
# cask "slack"
cask "spectacle"
# cask "stoplight-studio"
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
cask "zoom

cask_args appdir: "/Applications"
# cask "intellij-idea-ce"
# cask "iterm2"
# cask "rectangle"

brew "adr-tools"
brew "ansible"
brew "argocd"
brew "asciinema"
brew "asdf"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "bats-core"
brew "brotli"
brew "cairo"
brew "calicoctl"
brew "cfssl"
brew "cilium-cli"
brew "circleci"
brew "clusterawsadm"
brew "clusterctl"
brew "cmake"
brew "colima"
brew "copilot-cli"
brew "cosign"
brew "curl"
brew "deno"
brew "diffutils"
brew "direnv"
brew "dive"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker"
brew "envchain"
brew "etcdctl"
brew "exa"
brew "fd"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git-lfs"
brew "git", link: true, conflicts_with: ["git"]
brew "gitsign"
brew "glib"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "gobject-introspection"
brew "gpg"
brew "graphviz"
brew "gzip"
brew "harfbuzz"
brew "helm"
brew "heroku"
brew "htop"
brew "httpie"
brew "hubble"
brew "imagemagick"
brew "istioctl"
brew "jless"
brew "jq"
brew "just"
brew "k3d"
brew "k9s"
brew "kapp"
brew "kcat"
brew "kctrl"
brew "kdash"
brew "kind"
brew "kp"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "kubeseal"
brew "kubetail"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "libffi"
brew "libtool"
brew "libxml2"
brew "lima"
brew "lua-language-server"
brew "luajit", args: ["HEAD"]
brew "mas"
brew "mkcert"
brew "monit"
brew "moreutils"
brew "neofetch"
brew "neovim"
brew "netlify-cli"
brew "newman"
brew "nghttp2"
brew "ninja"
brew "nmap"
brew "nss"
brew "ntfs-3g"
brew "octant"
brew "opa"
brew "openssl"
brew "operator-sdk"
brew "p7zip"
brew "pack"
brew "pango"
brew "pass"
brew "pidcat"
brew "pigz"
brew "pngpaste"
brew "pnpm"
brew "podman-desktop"
brew "podman"
brew "pre-commit"
brew "pv"
brew "pwgen"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python@3.9"
brew "qemu"
brew "railway"
brew "raycast"
brew "rbenv"
brew "readline", link: true
brew "reattach-to-user-namespace"
brew "redisinsight"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "sanemat/font/ricty"
brew "screen"
brew "shellcheck"
brew "siege"
brew "skaffold"
brew "snyk"
brew "socat"
brew "starship"
brew "stern"
brew "talisman"
brew "telnet"
brew "tfenv"
brew "tig"
brew "tilt"
brew "tmux"
brew "tree-sitter"
brew "tree"
brew "unison"
brew "universal-ctags"
brew "v8"
brew "vault"
brew "vercel-cli"
brew "vim"
brew "watch"
brew "watchman"
brew "webp"
brew "wget"
brew "woff2"
brew "wolfssl"
brew "xz"
brew "yarn"
brew "yq"
brew "z"
brew "zopfli"
brew "zsh-completions"
brew "zsh"