cask_args appdir: "/Applications"

tap "arkweid/lefthook"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "sanemat/font"
tap "universal-ctags/universal-ctags"
tap "yutomizutani/jc"
tap "redis-stack/redis-stack"
tap "homebrew/cask-fonts"
tap "heroku/brew"

brew "docker"
brew "docker-compose"
brew "lima"
brew "colima"
brew "kubectl"
brew "telnet"
brew "jq"
brew "gzip"
brew "curl"
brew "httpie"
brew "nmap"
brew "moreutils"
brew "wget"
brew "ansible"
brew "asdf"
brew "kind"
brew "diffutils"
brew "htop"
brew "pass"
brew "pwgen"
brew "rsync"
brew "autoconf"
brew "docker-credential-helper"
brew "brotli"
brew "zopfli"
brew "pidcat"
brew "pv"
brew "screen"
brew "woff2"
brew "webp"
brew "autoconf"
brew "libtool"
brew "openssl"
brew "readline", link: true
brew "asdf"
brew "xz"
brew "bat"
brew "libffi"
brew "python@3.9"
brew "glib"
brew "cairo"
brew "deno"
brew "direnv"
brew "exa"
brew "fd"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git", link: true, conflicts_with: ["git"]
brew "gnupg"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "libxml2"
brew "lua-language-server"
brew "luajit", args: ["HEAD"]
brew "mas"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "pngpaste"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "unison"
brew "v8"
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "sanemat/font/ricty"
brew "universal-ctags"
brew "raycast"
brew "watchman"

cask "firefox"
cask "gyazo"
cask "imageoptim"
cask "iterm2"
cask "muzzle"
cask "skitch"
cask "visual-studio-code"
cask "sublime-text"
cask "spectacle"
cask "macfuse"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-source-code-pro"
cask "cyberduck"
cask "rancher"
cask "alacrity"
cask "raycast"
cask "alacritty"
cask "spectacle"
cask "rancher"
cask "postman"
cask "intellij-idea-ce"
cask "brave-browser"
cask "dbeaver-community"
cask "mongodb-compass"
cask "drawio"
cask "lulu"
cask "redisinsight"
cask "hex-fiend"
cask "chromium"
# cask "osxfuse"

brew "docker-compose"
brew "lima"
brew "colima"
brew "qemu"
brew "octant"
brew "k9s"
brew "kubectl"
brew "skaffold"
brew "telnet"
brew "jq"
brew "xz"
brew "gzip"
brew "curl"
brew "httpie"
brew "nmap"
brew "moreutils"
brew "wget"
brew "ansible"
brew "asdf"
brew "kind"
brew "diffutils"
brew "htop"
brew "pass"
brew "pwgen"
brew "rsync"
brew "autoconf"
brew "docker-credential-helper"
brew "brotli"
brew "zopfli"
brew "pidcat"
brew "pv"
brew "screen"
brew "woff2"
brew "webp"
brew "asciinema"
brew "p7zip"
brew "pigz"
brew "socat"
brew "gmp"
brew "gpg"
brew "rustup"
brew "shellcheck"
brew "automake"
brew "wolfssl"
brew "pnpm"
brew "ntfs-3g"
brew "tilt"
brew "dive"
brew "vercel-cli"
brew "heroku"
brew "railway"
brew "netlify-cli"
