cask_args appdir: "/Applications"

tap "arkweid/lefthook"
tap "eugenmayer/dockersync"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sanemat/font"
tap "yutomizutani/jc"

brew "imath"
brew "autoconf"
brew "libtool"
brew "openssl@1.1"
brew "readline", link: true
brew "asdf"
brew "xz"
brew "aws-elasticbeanstalk"
brew "bat"
brew "libffi"
brew "python@3.9"
brew "glib"
brew "cairo"
brew "deno"
brew "direnv"
brew "exa"
brew "fd"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "git", link: true, conflicts_with: ["git"]
brew "gnupg"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libxml2"
brew "lua-language-server"
brew "luajit", args: ["HEAD"]
brew "mas"
brew "mysql"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "pngpaste"
brew "postgresql", restart_service: true
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "unison"
brew "v8@3.15"
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "sanemat/font/ricty"
brew "universal-ctags"
brew "raycast"

cask "alfred"
cask "chromedriver"
cask "deepl"
cask "docker"
cask "firefox"
cask "google-japanese-ime"
cask "gyazo"
cask "imageoptim"
cask "iterm2"
cask "muzzle"
cask "spotify"
cask "sidekick"
cask "skitch"
cask "slack"
cask "visual-studio-code"
cask "zoom"
